#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-keycloak_cust/runs/run-c5t3Uo5b8o1YLmux

Waiting for the plan to start...

Terraform v0.15.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=802f1d36-b108-4397-a8ec-c21e59dd7cae]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=417d247a-5183-4a95-ac72-180fa91bde9b]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=b99e92e1-b511-48d0-a667-dec8baa567b8]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=ef30d3ad-5550-4098-9359-9908c0620b62]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=837635b3-fc3a-4442-9148-451f1b74ca55]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5aa5ebed-497c-42a5-b8be-518ba04f74ca]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29f047e8-c730-4351-bfc6-b52f399dd9ea]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=3df466d9-10ea-4046-adc1-22e0fe9dba3f]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=3e8f1e74-984b-4267-8b0f-8b22469fd055]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=602df616-9e86-41a7-8877-fe684ecabff1]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=4665917c-4624-4e76-8dda-15d05c596f0a]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=27bb0ecd-8865-476d-a5d5-49b318862d17]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=ab3ae44b-725a-42f8-bcc2-98a4be33783d]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=26f2fc8f-0c8c-417a-ba8a-ff22a76c5ce9]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=0c62f2ce-c27e-4173-b692-57789a7a9bc7]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=648884f9-6c6e-4c1f-8c92-156560e7cb49]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=94d6e111-35e7-4af0-8c2c-5d1edb6bde21]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2d7aa8d1-63d1-436b-a556-bfb2702ebbc2]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4df5b321-c4b5-4cb5-961b-3b01d71470f1]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bc415c7a-fce1-4ce5-9916-8b28879ca671]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c6eaa078-6965-4f29-85c4-28a4e7f9ae27]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e20f31c0-6a4b-44fd-98c2-d9210456df34]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29935c7c-1439-4665-9d86-02672a8d71ad]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dbb8d93f-8bf6-47ba-9280-f2902412d568]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "ef30d3ad-5550-4098-9359-9908c0620b62"
        name                                     = "test-client"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "27bb0ecd-8865-476d-a5d5-49b318862d17"
        name                                     = "test-client"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "ab3ae44b-725a-42f8-bcc2-98a4be33783d"
        name                                     = "test-client"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "0c62f2ce-c27e-4173-b692-57789a7a9bc7"
        name                                     = "test-client"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "b99e92e1-b511-48d0-a667-dec8baa567b8"
        name                                     = "test-client"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "602df616-9e86-41a7-8877-fe684ecabff1"
        name                                     = "test-client"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3df466d9-10ea-4046-adc1-22e0fe9dba3f"
        name                                     = "test-client"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "26f2fc8f-0c8c-417a-ba8a-ff22a76c5ce9"
        name                                     = "test-client"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }
  # module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "802f1d36-b108-4397-a8ec-c21e59dd7cae"
        name                                     = "test-client"
      + web_origins                              = []
        # (13 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "work-bc-teacher-resources"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "work-bc-teacher-resources"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://teacher-resources-bdaa18-dev.apps.silver.devops.gov.bc.ca/",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 26 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*